examples/openfoam2206/emptyFetch/kOmegaSST/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    ground
    {
        type            nutRoughABLWallFunction;
        #include        "include/ABLConditions"

        z0              uniform $z0;
        ustar           uniform $ustar;
        kappaWF         uniform $kappaWF;
        
        A               uniform $A;
        B               uniform $B;
        C               uniform $C;
        D               uniform $D;
        Etke            uniform $E;
        CmuMax          uniform $CmuMax;
        blendCoeff      uniform $blendCoeff;
        zDir            uniform $zDir;
        roughWall       uniform $roughWall;

        thresholdU      uniform $thresholdU;
        thresholdE      uniform $thresholdE;
        thresholdK      uniform $thresholdK;
        thresholdO      uniform $thresholdO;

        constantU       uniform $constantU;
        constantE       uniform $constantE;
        constantK       uniform $constantK;
        constantO       uniform $constantO;

        betaStarMax     uniform $betaStarMax;
        WFbetaStar      uniform $WFbetaStar;

        E               9.793;
        value           uniform 0;
    }
    
    // building
    // {
    //     type            nutkWallFunction;
    //     Cmu             0.09;
    //     kappa           0.4;
    //     E               9.793;
    //     value           uniform 0;
    // }

    #include "include/sideAndTopPatches"

}
// ************************************************************************* //
